package Gallows;

public class Symbols {

    public static final String MENU = """ 
            --- ВИСЕЛИЦА ---
            
            1. Играть
            2. Выход
            
            Для того что бы начать игру или закончить введите цифру.
            """;

    public static final String[] GALLOWS = {

    """
       +---+
       |   |
       |   \s
       |   \s
       |   \s
       |   \s
       =====
    """,


    """
    +---+
    |   |
    |   O
    |   \s
    |   \s
    |   \s
    =====
    """,


    """
    +---+
    |   |
    |   O
    |   |
    |   \s
    |   \s
    =====
    """,


    """
    +---+
    |   |
    |   O
    |   |\\
    |   \s
    |   \s
    =====
    """,


    """
    +---+
    |   |
    |   O
    |  /|\\
    |   \s
    |   \s
    =====
    """,


    """
    +---+
    |   |
    |   O
    |  /|\\
    |   \\
    |   \s
    =====
    """,

    """
    +---+
    |   |
    |   O
    |  /|\\
    |  / \\
    |   \s
    =====
    """


    };
}


